# Структура квиза
quiz_data = [
    {
        'question': '1. Какая страна родина шахмат?',
        'options': ['Россия', 'Китай', 'Индия', 'Тува'],
        'correct_option': 2
    },
    {
        'question': '2. Сколько полей на шахматной доске?',
        'options': ['48', '64', '16', '50'],
        'correct_option': 1
    },
    {
        'question': '3. Назови среди фигур фигуру, которая ходит только вперед?',
        'options': ['Король', 'Пешка', 'Ферзь', 'Слон'],
        'correct_option': 1
    },
    {
        'question': '4. Нападение на короля называется?',
        'options': ['Мат', 'Шах', 'Пат', 'Ничья'],
        'correct_option': 1
    },
    {
        'question': '5. Ценность ферзя примерно равна',
        'options': ['Слону и коню', 'Ладье и двум пешкам', 'Двум ладьям', 'Пяти пешкам'],
        'correct_option': 0
    },
    {
        'question': '6. Сколько горизонталей на шахматной доске?',
        'options': ['16', '8', '32', '64'],
        'correct_option': 1
    },
    {
        'question': '7. Как называются косые ряды полей на шахматной доске?',
        'options': ['Вертикали', 'Горизонтали', 'Диаграммы', 'Диагонали'],
        'correct_option': 2
    },
    {
        'question': '8. Какая фигура всегда ходит только на одно поле?',
        'options': ['Король', 'Конь', 'Ферзь', 'Пешка'],
        'correct_option': 3
    },
    {
        'question': '9. Одновременное нападение на две фигуры?',
        'options': ['Ложка', 'Крышка', 'Вилка', 'Тарелка'],
        'correct_option': 2
    },
    {
        'question': '10. Самая ценная фигура в шахматном войске?',
        'options': ['Ферзь', 'Ладья', 'Король', 'Пешка'],
        'correct_option': 0
    }
]
